In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('green_tripdata_2019-10.csv.gz', compression='gzip', nrows=100)

In [5]:
df.dtypes

VendorID                   int64
lpep_pickup_datetime      object
lpep_dropoff_datetime     object
store_and_fwd_flag        object
RatecodeID                 int64
PULocationID               int64
DOLocationID               int64
passenger_count            int64
trip_distance            float64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
ehail_fee                float64
improvement_surcharge    float64
total_amount             float64
payment_type               int64
trip_type                  int64
congestion_surcharge     float64
dtype: object

In [4]:
df.head(5)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2,1,0.0
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2,1,0.0
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2,1,0.0
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2,1,0.0
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1,1,0.0

In [6]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [7]:
from sqlalchemy import create_engine

In [9]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [10]:
print(pd.io.sql.get_schema(df, name='green_taxi_data', con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [11]:
df_iter = pd.read_csv('green_tripdata_2019-10.csv.gz', compression='gzip',iterator=True, chunksize=100000)

In [12]:
df = next(df_iter)

In [13]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [15]:
df.head(n=0).to_sql(name='green_taxi_data', con=engine, if_exists='replace')

0

In [16]:
%time df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

CPU times: user 2.35 s, sys: 145 ms, total: 2.49 s
Wall time: 4.81 s

1000

In [17]:
from time import time

In [18]:
while True:
    t_start=time()
    
    df = next(df_iter)
    
    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

    df.to_sql(name='green_taxi_data', con=engine, if_exists='append')

    t_end=time()

    print('inserted another chunk...., took %.3f seconds' %(t_end-t_start))

inserted another chunk...., took 4.734 seconds
inserted another chunk...., took 4.435 seconds

/var/folders/zv/h0z4s_wx70xb3g60zz6bj1c00000gp/T/ipykernel_99669/423319157.py:4: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = next(df_iter)

inserted another chunk...., took 4.287 seconds
inserted another chunk...., took 2.859 seconds

StopIteration:

In [19]:
engine.connect()

In [21]:
query = """
SELECT COUNT(*) FROM green_taxi_data;
"""
pd.read_sql(query, con=engine)

    count
0  476386

In [22]:
df_zone = pd.read_csv('taxi_zone_lookup.csv')

In [23]:
df_zone.dtypes

LocationID       int64
Borough         object
Zone            object
service_zone    object
dtype: object

In [24]:
df_zone.head(n=0).to_sql(name='taxi_zone_lookup', con=engine, if_exists='replace')

0

In [25]:
df_zone.to_sql(name='taxi_zone_lookup', con=engine, if_exists='append')

265

In [26]:
query = """
SELECT * FROM taxi_zone_lookup LIMIT 10;
"""
pd.read_sql(query, con=engine)

   index  LocationID        Borough                     Zone service_zone
0      0           1            EWR           Newark Airport          EWR
1      1           2         Queens              Jamaica Bay    Boro Zone
2      2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3      3           4      Manhattan            Alphabet City  Yellow Zone
4      4           5  Staten Island            Arden Heights    Boro Zone
5      5           6  Staten Island  Arrochar/Fort Wadsworth    Boro Zone
6      6           7         Queens                  Astoria    Boro Zone
7      7           8         Queens             Astoria Park    Boro Zone
8      8           9         Queens               Auburndale    Boro Zone
9      9          10         Queens             Baisley Park    Boro Zone

Q1: During the period of October 1st 2019 (inclusive) and November 1st 2019 (exclusive), how many trips, respectively, happened:

Up to 1 mile
In between 1 (exclusive) and 3 miles (inclusive),
In between 3 (exclusive) and 7 miles (inclusive),
In between 7 (exclusive) and 10 miles (inclusive),
Over 10 miles

In [29]:
query = """
SELECT SUM(CASE WHEN trip_distance <= 1 THEN 1 END) AS upto_1_mile_trips,
SUM(CASE WHEN trip_distance > 1 and trip_distance <= 3 THEN 1 END) AS trips_1_to_3_miles,
SUM(CASE WHEN trip_distance > 3 and trip_distance <= 7 THEN 1 END) AS trips_3_to_7_miles,
SUM(CASE WHEN trip_distance > 7 and trip_distance <= 10 THEN 1 END) AS trips_7_to_10_miles,
SUM(CASE WHEN trip_distance > 10 THEN 1 END) AS over_10_mile_trips
FROM green_taxi_data 
WHERE CAST(lpep_pickup_datetime AS DATE) BETWEEN '2019-10-01' AND '2019-10-31'
;
"""
pd.read_sql(query, con=engine)

,upto_1_mile_trips,trips_1_to_3_miles,trips_3_to_7_miles,trips_7_to_10_miles,over_10_mile_trips
0,104830,198995,109642,27686,35201

Q: Which was the pick up day with the longest trip distance? Use the pick up time for your calculations.

Tip: For every day, we only care about one single trip with the longest distance.

In [30]:
query = """
SELECT CAST(lpep_pickup_datetime AS DATE), 
MAX(trip_distance) AS longest_trip
FROM green_taxi_data 
GROUP BY CAST(lpep_pickup_datetime AS DATE) 
ORDER BY 2 DESC
LIMIT 1
;
"""
pd.read_sql(query, con=engine)

  lpep_pickup_datetime  longest_trip
0           2019-10-31        515.89

Q: Which were the top pickup locations with over 13,000 in total_amount (across all trips) for 2019-10-18?

Consider only lpep_pickup_datetime when filtering by date.

East Harlem North, East Harlem South, Morningside Heights
East Harlem North, Morningside Heights
Morningside Heights, Astoria Park, East Harlem South
Bedford, East Harlem North, Astoria Park

In [38]:
query = """
SELECT Z."Zone", 
SUM(total_amount) AS amount
FROM green_taxi_data As T
INNER JOIN taxi_zone_lookup As Z ON T."PULocationID" = Z."LocationID"
WHERE CAST(lpep_pickup_datetime AS DATE) = '2019-10-18'
GROUP BY Z."Zone" 
HAVING SUM(total_amount) > 13000
ORDER BY 2 DESC
LIMIT 3
;
"""
pd.read_sql(query, con=engine)

                  Zone    amount
0    East Harlem North  18686.68
1    East Harlem South  16797.26
2  Morningside Heights  13029.79

Q: For the passengers picked up in October 2019 in the zone named "East Harlem North" which was the drop off zone that had the largest tip?

Note: it's tip , not trip

We need the name of the zone, not the ID.

In [40]:
query = """
SELECT Z."Zone", 
MAX(tip_amount) AS tip
FROM green_taxi_data As T
INNER JOIN taxi_zone_lookup As Z ON T."DOLocationID" = Z."LocationID"
INNER JOIN taxi_zone_lookup As PZ ON T."PULocationID" = PZ."LocationID"
WHERE CAST(lpep_pickup_datetime AS DATE) BETWEEN '2019-10-01' AND '2019-10-31'
AND PZ."Zone" = 'East Harlem North'
GROUP BY Z."Zone" 
ORDER BY 2 DESC
LIMIT 1
;
"""
pd.read_sql(query, con=engine)

          Zone   tip
0  JFK Airport  87.3